Truss references (chains of one or more reference lines) should not form closed loops."
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TrussClosedReference { get; }
  Visual Basic
Public Shared ReadOnly Property TrussClosedReference As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TrussClosedReference {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace